Repository: abeltyr/adret_v1.0.0
Catalog: lib/localization/app_*.arb
Languages: am

source: Shop
am: ሱቅ

source: Reconnect
am: እንደገና ይሞክሩ

source: Internet Issue
am: የኔትዎርክ ችግር

# networkErrorPrompt
source: This App requires internet connection to keep everything in sync and working properly. How to fix it.
am: ይህ አፕሊኬሽን በትክክል እንዲሠራ ኔትዎርክ ያስፈልገዋል ችግሩን ለመፍታት

# turnOnData
source: Turn your cellular data Or Connect to a working wifi
am: እባኮን ነትዎርክ ያብሩ

# welcomeMessage
source: Welcome to Adret
am: እንኳን ወደ አድሬት በደህና መጡ

# loginPrompt
source: Please provide your Detail to login
am: ለመግባት የመለያ መረጃዎችን ያስገቡ

source: Company Code
am: የድርጅት መለያ ቁጥር

source: Username
am: መለያ ስም

source: Password
am: ማልፉያ ቃል

# companyRequired
source: Company code is required
am: የድርጅት መለያ ቁጥር ያስፈልጋል

# usernameRequired
source: Please input your username
am: መለያ ስም ያስገቡ

# passwordRequired
source: Please input your password
am: ማልፉያ ቃሎን ያስገቡ

# errorNotification
source: Something went wrong. Please try again.
am: ችግር ተፈጥሯል እባክዎ እንደገና ይሞክሩ

source: Employee
am: ሠራተኞ

source: Employees
am: ሠራተኞች

source: Add Employee
am: ሠራተኛ ይጨምሩ

# addEmployeeButtonText
source: Click the button bellow to add your employee
am: ሠራተኞችን ለመጨመር ከዚህ በታች ያለውን ይጫኑ

# noEmployee
source: No Employees under this shop
am: በዚህ ሱቅ ስር ምንም ሠራተኛ አልተመዘገቡም

source: Full Name
am: ሙሉ ስም

source: Phone Number
am: ስልክ ቁጥር

source: Confirm Password
am: ለማረጋገጥ በድጋሚ የይለፍ ቃል ያስገቡ

# shortName
source: Name is too short
am: የስገቡት ስም አጭር ነው

# phoneNumberErrorMessage
source: Please provide a valid phone number, starting with +251
am: እባክዎ በ +251 የሚጀምር ትክክለኛ ስልክ ቁጥር ያስገቡ

# passwordErrorMessage
source: Password must contain a Special character, number, upper and lower case
am: ለይለፍ ቃሉ ቁጥሮችን እና የተለያዩ ባህሪ ካላት, ማካተት አለበት

# confirmPasswordErrorMessage
source: Password doesn't match
am: የገቡት የይልፍ ቃላቶች አልተመሳስሉም

# createUserError
source: User Creation issue
am: ተጠቃሚ መፍጠር አልተቻለም

source: Create
am: ፍጠር

source: Profile
am: የራስ መግለጫ

# emailErrorMessage
source: Please provide a valid email address
am: እባክዎ ትክክለኛ ኢሜል ያስገቡ

# profileUpdateMessage
source: Profile updated successful!
am: የራስ መግለጫው በሚገባ ተስተካክሏል

source: Update
am: አስተካክል

# passwordUpdateMessage
source: Password updated successful!
am: የሚስጥር ቃል በሚገባ ተስተካክሏል

source: Old password
am: የበፊቱ የሚስጥር ቃል

source: New password
am: አዲስ የሚስጥር ቃል

source: Re-enter password
am: በድጋሚ የሚስጥር ቃል ያስገቡ

source: Email Address
am: ኢሜል

source: Checkout
am: መሸጫው

source: Close
am: ይዘጋ

# emptyCheckoutMessage
source: No Product has been added for checkout.
am: ለመሸጫው ምንም አይነት እቃ ኣልተጨመረም

source: ETB
am: ብር

source: items
am: የእቃ አይነቶች

source: Price is to low
am: ዋጋው ከተቀመተው መጠን ወርዱዋ

# orderCreatedMessage
source: Order created successfully
am: የሽያቹ ትእዛዙ በተሳካ ሁኔታ ተፈጥሯል

# orderCreatedMessageWithNote
source: Order created successfully. Note: you have a summary filter on so might not see the current sale.
am: የሽያቹ ትእዛዙ በተሳካ ሁኔታ ተፈጥሯል:: ማሳሰቢያ፡ የሽያጭ ማጣሪያ ስላሎት የአሁኑን ሽያጭ ላያዩት ይችላል።

# saleClosedMessage
source: today sales collected and closed by manger
am: የዛሬ ሽያጭ በማናጀሩ ተሰብስቦ ተዘግቷል

# saleClosedErrorMessage
source: Manager has collected and closed today sales. Please contact manager.
am: ማናጀሩ ይቀኑን ሽያጭ ሰብስቦ ዘግቶታል። እባክዎ ማናጀሩን ያናግሩ።

source: Sell
am: ሽጥ

source: InStocks Data
am: የክምችት መረጃ

source: Selling Price
am: የመሽጫ ዋጋ

source: Add Product
am: እቃ ጨምር

source: Product Title
am: እቃ ስም

source: Product
am: እቃ

source: Closing Product update
am: የእቃ ማስተካከያውን በመዝጋት ላይ

# closeProductUpdateMessage
source: You have not saved your progress, if you close now all the updates you made will be lost
am: ያሉበት ሁኔታ አልተመዘገበም። አሁን ከዘጉት የተደረጉት ማስተካከያዎች በሙሉ ይጥፋሉ።

source: Cancel
am: ይዘጋ

source: All Products
am: ሁሉም እቃዎች

source: Manager
am: ማናጀር

# addProductPrompt
source: Add Your Products and start tracking your profit
am: እቃዎትን ጨምረው ትርፍ ማካበት ይጀምሩ

# addProductNotice
source: You can start selling once Product are added.
am: ምርቶን ከተጨመረ በኋላ መሸጥ መጀመር ይችላሉ።

# noProducts
source: No Product Was Found.
am: ምንም እቃ አልተገኸም

source: Top Selling
am: ከፍተኛ የተሽጡ

# searchPrompt
source: Search Products Based On Product Title Or Product Code.
am: ስም ወይንም መለያ ቁትር በመጠቀም እቃዎችን ይፈልጉ

# searchProducts
source: Search product
am: እቃዎችን ይፈልጉ

# fetchDataError
source: Error Fetching data. please pull down to reload
am: መረጃ ማሳየት አልተቻለም። ወደታች በመሳብ እንደገና ይሞክሩ

source: Summary
am: ሽያጭ መረጃ

source: Daily Summary
am: የቀኑ ሽያጭ መረጃ

source: No sales So far
am: እስካሁን ምንም ሽያጭ የለም

# goToSell
source: Go to product and start selling
am: ወደ እቃዎች ዝርዝር ይሂዱና መሸጥ ይጀምሩ

source: filter
am: አጣራ

source: Date
am: ቀን

source: All Employees Sales
am: የሑሉም ሠራታኞች ሽያጭ

source: No items found
am: ምንም እቃ አልተገየም

# emptyListMessage
source: The list is currently Empty
am: ዝርዝሩ አሁን ላይ ባዶ ነው

source: Inventory Title
am: የዝርዝር እቃ ስም

source: Earning
am: ገቢ

source: Order
am: ሽያጭ

source: Sales
am: ሽያጭ

source: Collect
am: ሰብስብ

source: Collecting
am: በመሰብሰብ ላይ

source: Collected
am: ተሰብስብዋል

source: Profit
am: ትርፍ

source: Collect Employee
am: የሠራተኛ

# collectEmployeeCaution
source: Caution only click collect button at the end of the work day or when closing up, and after collecting money from the employee.
am: ማሳሰቢያ ከታች ሰብስብ የሚለውን የሚጫኑት በቀኑ መጨረሻ ሱኩን ሲዘጉ እንዲሁም ከሰራተኞች ገንዘብ ከሰበሰቡ በኋላ ብቻ የሁን።

source: Pull up load
am: ወደ ላይ በመሳብ አዲስ መረጃ ያግዩ።

# loadFailMessage
source: Load Failed!Click retry!
am: ችግር አጋጠመን። እንደገና ይሞክሩ የሚለውን ይጫኑ

# leasePullLoad
source: Release to load more
am: ይልቀቁት አዲስ መረጃ ለማግየት።

source: No more Data
am: ተጨማሪ መረጃ የለም

source: Save
am: አስቀምጥ

source: Done
am: ጨርስ

# cameraAccessDenied
source: This Device has denied access to you camera
am: ይህ ስልክ ካሜራው ለመተቀሚያ ፈቃድ ከልክሉዋል

# goToGiveAccess
source: Go to setting to give access
am: ፈቃድ ለመስጠት ወደ ማስተካከያው ይግቡ

source: Open setting
am: ማስተካከያውን ይክፈቱ

source: Category
am: እቅው ምድብ

# category1
source: shoe
am: ጭማ

# category2
source: Electronics
am: የኮምፒተር

# category3
source: cloth
am: ልብስ

# category4
source: vehicle
am: ተሽከርካሪ

# productDescriptionPrompt
source: Write A Product Description
am: ስለእቅው መግለጫ አስገባ

source: Add Category
am: የእቃው ምድብ

source: Description
am: መግለጫ

# fetchingProductErrorMessage
source: Error fetching current product
am: እቃዎችን መረጃ ማግየት አልተችሃለም

# closeOrReloadPage
source: Please close or reload the page
am: እባክዎ እንደገና ይጫኑ ወይንም ገጹን ይዝጉት

source: Reload
am: እንደገና የሞክሩ

source: Inventory
am: ዝርዝር

source: Inventories
am: ዝርዝሮች

source: Available
am: ብዛት

source: Add Inventory
am: ዝርዝር ጨምር

# addInventoryPrompt
source: Press the button bellow to add the inventory detail
am: የአየነቶች ዝርዝር መረጃ ለመጨምር ከታች ያለውን በተን ይጫኑ

# addInventoryCaution
source: a product can only have 10 variation. please create a new product.
am: አንድ እቃ ከ10 በላይ ዝርዝሮች ለኖሩት አይችልም። እባክዎ አዲስ እቃ የፍተሩ::

source: Variations
am: አየነቶች

source: Variation
am: አየነት

# validTextPrompt
source: Please provide a valid text
am: እባክዎ ትክክለኛ ጽሁፍ ያስገቡ

# uploadProductImage
source: Upload Product Images
am: ለእቃው ፎቶ ይጨምሩ

# mediaErrorMessage
source: No Media Was Found
am: ምንም ፎቶዎችህ አልተገኘም

# cameraAccessPrompt
source: This Feature requires Access to your Photos
am: ይህ አገልግሎት ለፎቶዎችዎ ፍቃድ ይፈልገዋል

source: Settings
am: ማስተካከያዎች

source: Setting
am: ማስተካከያ

source: Photo Library
am: የፎቶ ማስቀመቻ

source: Buying Price
am: የተገዛበት ዋጋ

source: Min Selling Price
am: አነስተኛ የመሸጫ ዋጋ

source: Max Selling Price
am: ከፍተኛ የመሸጫ ዋጋ

source: Min
am: አነስተኛ

source: Max
am: ከፍተኛ

source: Pricing
am: የዋጋ መረጃ

source: Range
am: መነሻ ዋጋ አለው

source: Sign in
am: ግባ

source: Log Out
am: ዘግትህ ውጣ

source: Update account
am: የራስ መረጃ አድስ

source: Confirm
am: እስማማለሁ

# shortUserName
source: User name is too short
am: መለያ ስሙ አጭር ነው

source: Total earning
am: አጠቃላይ ገቢ

source: Add
am: ጨምር

source: back
am: ተመለስ

# removeImage
source: Remove the current Image
am: አሁን ያለውን ፎቶ አጥፋ

source: Delete
am: አጥፋ

source: on
am: በ

# noSales
source: No Sale's Yet
am: እስካሁን ምንም ሽያጭ የለም

# goToProduct
source: Go to the product and complete an order to make then appear here.
am: ወደ እቃ ስክሪን ይሂዱ እና ትዕዛዝ ይሙሉ፤ ሽያጮች እዚጋ እንዲመቱ

# noUsers
source: No Employees Found
am: ሱቁ ሰራተኞች የለውም

source: Empty Cart
am: ምንም እቃ አልትመርጠም

# emptyCartDetail
source: Please add a product to the checkout, by swiping left on the product card or click on the cart icon inside the product.
am: እባክዎ እቃ ወደ መውጫው ይጭምሩ፣ በእቃ ካርዱ ላይ ወደ ግራ በማንሸራተት ወይም በእቃ ውስጥ ያለውን የጋሪ ምለክት ጠቅ ያድርጉ።

source: Language
am: ቋዋንቋ

source: Languages
am: ቋዋንቋዎች

# remaining
source: Available
am: ቀሪ

# productDetail
source: Inventory Detail
am: የእቃ መረጃ

# productsFetchError
source: Something went wrong and could not fetch product.
am: የሆነ ችግር ተፈጥሯል እና እቃዎችን ማምጣት አልተችሃለም።

# productsFetchErrorTitle
source: Error Fetching Products
am: እቃኦችን መዘርዝር አልተቻለም

source: Retry
am: እንደገና ይሞክሩ

source: Media
am: ፎቶዎች

source: Add Variation
am: አየነት ጨምር

source: Take Photo
am: ፎቶ አንሳ

# inData
source: In
am: ለ

# photoErrorPartTwo
source: settings, please give Adret access to your photo library
am: መቼቶች፣ እባክህ ለአድሬት የፎቶ ማስቀመጫ ፈቃድ ይስጡት

# continueData
source: Cancel
am: አይዘጋ

source: value
am: አየነት

# cartAdded
source: Product Added to Cart
am: እቃው ወደ ጋሪ ተጨምሩዋል

# outOfStock
source: The selected item is out of stock
am: የተመረጠው እቃ ነገር አልቋዋል

# buyingPriceError
source: Please provide a valid buying price
am: እባክዎ ትክክለኛ የግዢ ዋጋ ይስገቡ

# addImageError
source: Please provide at least one image
am: እባክዎ ቢያንስ አንድ ፎቶ ይስገቡ

# titleError
source: Please provide a title for the product
am: እባክዎ ለእቃው ስም ይስገቡ

# categoryError
source: Please provide the product category
am: እባክዎ የእቃው ምድብ ይስገቡ

# inventoryValidationError
source: Inventory validation failed
am: የእቃ ዝርዝር መረጃ ላይ ችግር አለው

# minSellingPriceError
source: Please provide a valid min selling price
am: እባክህ ትክክለያ አነስተኛ የመሸጫ ዋጋ ይስገቡ

# minInitialValidationError
source: The min selling Price can't be less than the initial Price
am: አነስተኛ የመሸጫ ዋጋው ከግዢው ዋጋው ያነሰ ሊሆን አይችልም።

# maxSellingPriceError
source: Please provide a valid max Selling price
am: እባክዎ ትክክለያ ከፍተኛ የመሸጫ ዋጋ ይስገቡ

# minMaxValidationError
source: Min selling price can't be greater than the max selling price
am: አነስተኛ የመሸጫ ዋጋ ከከፍተኛው የመሸጫ ዋጋ ሊበልጥ አይችልም።

source: Latter
am: በኋላ

# categoryTextToLong
source: Category can't be this long
am: የ አይነት ስም ያህን ያህል ረጅም ሊሆን አይችልም

# categoryTextError
source: Please select or add a category
am: እባክዎ አይነት ይምረጡ ወይም የጨምሩ
